#include <stdio.h>
#include <locale.h>
void func();
void date();
void house();
void main()
{
	setlocale(LC_ALL, "RUS");
	puts("Hello world!");
	puts("Моя программа");
	puts("Нажмите ENTER для продолжения...");
	getchar();
	puts("Продолжение программы");
	func();
	date();
	house();
}
void func()
{
	puts("************************************************");
	puts("*                                              *");
	puts("*   тема: Разработка консольного приложения    *");
	puts("*         Выполнил: Ларин М.А.                 *");
	puts("*                                              *");
	puts("************************************************");
}

void date()
{
	puts(" -- --  --   --   --   --  --   --");
	puts("| |  | | |  |_|   _|  | | | |  |_");
	puts("|_|  | |_|   _|  |__  |_| |_|  |_|");
}
void house()
{
	puts("             _");
	puts("            / \\");
	puts("           /   \\");
	puts("          /     \\");
	puts("         /       \\");
	puts("        /         \\");
	puts("       /           \\");
	puts("      /  _________  \\");
	puts("     /  |    |    |  \\");
	puts("    /   |    |    |   \\");
	puts("   /    |    |    |    \\");
	puts("  /     |____|____|     \\");
	puts(" /_______________________\\");
	puts("/|   _________________   |\\");
	puts(" |   |       |       |   |");
	puts(" |   |       |       |   |");
	puts(" |   |       |       |   |");
	puts(" |   |_______|_______|   |");
	puts(" |                       |");
	puts(" |_______________________|");
}